# DataFrame-Pandas

In [1]:
#DataFrame-with DataFrame we can create two dimenton table with row and column
import numpy as np
import pandas as pa

In [7]:
#creating DataFrame using List
lst=["Asha",'Versha','baby','Azula']
df=pa.DataFrame(data=lst)#it's automatically generated row and column as 0,1...
df

        0
0    Asha
1  Versha
2    baby
3   Azula

In [8]:
#in DataFrame,if we use print() ,it give output as normal but directly if we print,it's give colorfull output
print(df)

        0
0    Asha
1  Versha
2    baby
3   Azula

In [13]:
#how to set row and column names as we wamt into the DataFrame
lst2=["Asha",'Versha','baby','Azula'],['mani','raju','Raj','Muthu']
print(lst2)
print('*'*50)
df1=pa.DataFrame(lst2,index=['Girls','Boys'],columns=['A','B','C','D'])#index-row heading,columns-Column headings
print(df1)

(['Asha', 'Versha', 'baby', 'Azula'], ['mani', 'raju', 'Raj', 'Muthu'])
**************************************************
          A       B     C      D
Girls  Asha  Versha  baby  Azula
Boys   mani    raju   Raj  Muthu

In [15]:
#creating a dictionary containing employee data into dataframe
data={'NAME':['Karthik','Bharat','Vasu','Mani'],
     'AGE':[23,45,56,24],
      'ADDRESS':['TCR','Chennai','Coimbatore','Madurai'],
      'QUALIFICATION':['BSC(CS)','BTEC','MTEC','Bcom']
     }
print(data)
print('*'*50)
df2=pa.DataFrame(data)#it's take dictionary key values as Column heders
df2

{'NAME': ['Karthik', 'Bharat', 'Vasu', 'Mani'], 'AGE': [23, 45, 56, 24], 'ADDRESS': ['TCR', 'Chennai', 'Coimbatore', 'Madurai'], 'QUALIFICATION': ['BSC(CS)', 'BTEC', 'MTEC', 'Bcom']}
**************************************************

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom

In [16]:
print(df2)

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom

In [18]:
#how to fetch index(row) values and columns values
print(df2.index)
print(df1.index)
print(df2.columns)

RangeIndex(start=0, stop=4, step=1)
Index(['Girls', 'Boys'], dtype='object')
Index(['NAME', 'AGE', 'ADDRESS', 'QUALIFICATION'], dtype='object')

In [23]:
#selecting a column
print(df2)
print('*'*50)
print(df2['NAME'])#mentioned column datas
print(df2[['NAME']])#mentioned column datas with column header

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************
0    Karthik
1     Bharat
2       Vasu
3       Mani
Name: NAME, dtype: object
      NAME
0  Karthik
1   Bharat
2     Vasu
3     Mani

In [25]:
#selecting a multiple columns
print(df2)
print('*'*50)
print(df2[['NAME','AGE']])#mentioned Name and age column datas and with column headers

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************
      NAME  AGE
0  Karthik   23
1   Bharat   45
2     Vasu   56
3     Mani   24
      NAME
0  Karthik
1   Bharat
2     Vasu
3     Mani

In [45]:
#Access the Values from DataFrame
#iloc-which is used to fetch we given specific row
print(df2)
print('*'*50)
#if i want fetch only Karthik row 
print(df2.iloc[0])
print('*'*50)
#if we want to fetch one value from dataframe,we can use below statment
print(df2['NAME'][0])

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************
NAME             Karthik
AGE                   23
ADDRESS              TCR
QUALIFICATION    BSC(CS)
Name: 0, dtype: object
**************************************************
Karthik

In [48]:
#drop-it is used to delete one 
print(df2)
print('*'*50)
#if we want delete One column,use below code
df2.drop('AGE',axis=1)

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************

      NAME     ADDRESS QUALIFICATION
0  Karthik         TCR       BSC(CS)
1   Bharat     Chennai          BTEC
2     Vasu  Coimbatore          MTEC
3     Mani     Madurai          Bcom

In [49]:
#if we want delete One row,use below code
df2.drop(0,axis=0)

     NAME  AGE     ADDRESS QUALIFICATION
1  Bharat   45     Chennai          BTEC
2    Vasu   56  Coimbatore          MTEC
3    Mani   24     Madurai          Bcom

In [50]:
df2#above we did drop changes not applied in real varible if we want to delete permently we can use inplace

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom

In [51]:
df2.drop('AGE',axis=1,inplace=True)#Age column deleted Permently using inplace keyword

In [52]:
df2

      NAME     ADDRESS QUALIFICATION
0  Karthik         TCR       BSC(CS)
1   Bharat     Chennai          BTEC
2     Vasu  Coimbatore          MTEC
3     Mani     Madurai          Bcom

In [53]:
#create DataFrame with NaN values
import pandas as pa
import numpy as np
nan_dataframe=pa.DataFrame([[10,np.nan,30],[40,50,np.nan],[60,70,80],[np.nan,np.nan,np.nan]])
nan_dataframe

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [56]:
#dropna-which is used to drop row or column which are contain NaN value and display unnan values
print(nan_dataframe.dropna())#defaultly it will deleted row wise
print('*'*50)
print(nan_dataframe.dropna(axis=0))#row
print('*'*50)
print(nan_dataframe.dropna(axis=1))#if we want delete column wise use axis=1
#if we want to permently delete non values in DataFrame ,use inplace=True

      0     1     2
2  60.0  70.0  80.0
**************************************************
      0     1     2
2  60.0  70.0  80.0
**************************************************
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [72]:
#thresh-it will display non-nan valus rows or columns as we given value
print(nan_dataframe)
print('*'*50)
print(nan_dataframe.dropna(thresh=2))#it's display which are the row has two non-Nan values
print('*'*50)
print(nan_dataframe.dropna(thresh=3,axis=0))#it's display which are the row has three non-Nan values
print('*'*50)
print(nan_dataframe.dropna(thresh=3,axis=1))#it's display which are the column has three non-Nan values
#use inplace=true to permenant cahnge

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN
**************************************************
      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
**************************************************
      0     1     2
2  60.0  70.0  80.0
**************************************************
      0
0  10.0
1  40.0
2  60.0
3   NaN

In [80]:
#fillna-it is used to fill we given value to nan value posotion
print(nan_dataframe)
print('*'*50)
print(nan_dataframe.fillna(value="karthik"))
print('*'*50)
print(nan_dataframe.fillna(value=20))
print('*'*50)
print(nan_dataframe.fillna(value=nan_dataframe.mean()))

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN
**************************************************
         0        1        2
0     10.0  karthik     30.0
1     40.0     50.0  karthik
2     60.0     70.0     80.0
3  karthik  karthik  karthik
**************************************************
      0     1     2
0  10.0  20.0  30.0
1  40.0  50.0  20.0
2  60.0  70.0  80.0
3  20.0  20.0  20.0
**************************************************
           0     1     2
0  10.000000  60.0  30.0
1  40.000000  50.0  55.0
2  60.000000  70.0  80.0
3  36.666667  60.0  55.0

In [84]:
#concat-it is used to concat two dataFrames or more than two dataframes
print(df1)
print('*'*50)
print(df2)
print('*'*50)
print(pa.concat([df1,df2]))

          A       B     C      D
Girls  Asha  Versha  baby  Azula
Boys   mani    raju   Raj  Muthu
**************************************************
      NAME     ADDRESS QUALIFICATION
0  Karthik         TCR       BSC(CS)
1   Bharat     Chennai          BTEC
2     Vasu  Coimbatore          MTEC
3     Mani     Madurai          Bcom
**************************************************
          A       B     C      D     NAME     ADDRESS QUALIFICATION
Girls  Asha  Versha  baby  Azula      NaN         NaN           NaN
Boys   mani    raju   Raj  Muthu      NaN         NaN           NaN
0       NaN     NaN   NaN    NaN  Karthik         TCR       BSC(CS)
1       NaN     NaN   NaN    NaN   Bharat     Chennai          BTEC
2       NaN     NaN   NaN    NaN     Vasu  Coimbatore          MTEC
3       NaN     NaN   NaN    NaN     Mani     Madurai          Bcom

In [89]:
#crating data frame using concat two series
from pandas import DataFrame,Series
ser1=Series(np.arange(3),index=['A','B','C'])
print(ser1)
print('*'*50)
ser2=Series(np.arange(11,13),index=['X','Y'])
print(ser2)
print('*'*50)
print(pa.concat([ser1,ser2],axis=1,sort=False))#it's concatinated like column it's added first series as first column.second
                                              #series as a second column
print('*'*50)
print(pa.concat([ser1,ser2],axis=0,sort=True))#it's concatinated like a rowise
print('*'*50)
print(pa.concat([ser1,ser2],axis=0,keys=['Tab1','Tab2']))

A    0
B    1
C    2
dtype: int32
**************************************************
X    11
Y    12
dtype: int32
**************************************************
     0     1
A  0.0   NaN
B  1.0   NaN
C  2.0   NaN
X  NaN  11.0
Y  NaN  12.0
**************************************************
A     0
B     1
C     2
X    11
Y    12
dtype: int32
**************************************************
Tab1  A     0
      B     1
      C     2
Tab2  X    11
      Y    12
dtype: int32